In [32]:
import pandas as pd 
import numpy as np

In [33]:
s=pd.Series([1,2,3,4],index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [34]:
s["a"]

np.int64(1)

In [35]:
s2=s.reindex(["b","d","a","c","e"])#"reindexes" each of the values according to index name
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [36]:
s3 = pd.Series(["blue", "yellow", "purple"], index=[0, 2, 4])
s3

0      blue
2    yellow
4    purple
dtype: object

In [37]:
s3.reindex(range(6), method="ffill")

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
dtype: object

In [38]:
df = pd.DataFrame(np.arange(9).reshape(3,3), index=["a","c","d"],columns=["Tim","Tom","Kate"])
df

   Tim  Tom  Kate
a    0    1     2
c    3    4     5
d    6    7     8

In [39]:
df2 = df.reindex(["d","c","b","a"])#adds new indexes and changes order if the index is already in the DataFrame
df2

   Tim  Tom  Kate
d  6.0  7.0   8.0
c  3.0  4.0   5.0
b  NaN  NaN   NaN
a  0.0  1.0   2.0

In [40]:
names=["Kate","Tim","Tom"]
df.reindex(columns=names)

   Kate  Tim  Tom
a     2    0    1
c     5    3    4
d     8    6    7

In [41]:
df.loc[["c","d","a"]]# access rows by index name and not number(iloc accesses by number and not name)

   Tim  Tom  Kate
c    3    4     5
d    6    7     8
a    0    1     2

In [42]:
s=pd.Series(np.arange(5.),index=["a","b","c","d","e"])#5. declares it as float
s

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [43]:
new_s=s.drop("b")#removes b from the Series, can delete multiple values
new_s

a    0.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [44]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=["Kate","Tim","Tom","Alex"],columns = list("ABCD"))
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [45]:
data.drop(["Kate","Tim"])

       A   B   C   D
Tom    8   9  10  11
Alex  12  13  14  15

In [46]:
data.drop("A",axis=1)#deletes any column with axis=1

       B   C   D
Kate   1   2   3
Tim    5   6   7
Tom    9  10  11
Alex  13  14  15

In [47]:
data.drop("Kate",axis=0)#deletes any row with axis=0

       A   B   C   D
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [48]:
data#drop does not affect original DataFrame and only outputs the values

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [49]:
data.mean(axis="index")#takes the mean of each columns

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [50]:
data.mean(axis="columns")

Kate     1.5
Tim      5.5
Tom      9.5
Alex    13.5
dtype: float64